Revit 2027 API
DirectShapeLibrary.AddDefinition(String, IList<GeometryObject>) Method
 Add a definition to be reused by instances. A definition is a collection of geometry objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddDefinition(
	string id,
	IList<GeometryObject> GNodes
)
Public Sub AddDefinition (
	id As String,
	GNodes As IList(Of GeometryObject)
)
public:
void AddDefinition(
	String^ id,
	IList<GeometryObject^>^ GNodes
)
member AddDefinition :
        id : string *
        GNodes : IList<GeometryObject> -> unit
Parameters
id String
 ID of the definition to be added. Must be unique.
GNodes IList<GeometryObject>
 Definition as a list of Geometry objects
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
AddDefinition Overload
Autodesk.Revit.DB Namespace